{
    "model": {
        "format": "graph-model",
        "generatedBy": "2.9.1",
        "convertedBy": "TensorFlow.js Converter v3.18.0",
        "signature": {
            "inputs": {
                "conv2d_input": {
                    "name": "conv2d_input:0",
                    "dtype": "DT_FLOAT",
                    "tensorShape": {
                        "dim": [
                            { "size": "-1" },
                            { "size": "150" },
                            { "size": "150" },
                            { "size": "3" }
                        ]
                    }
                }
            },
            "outputs": {
                "dense_1": {
                    "name": "Identity:0",
                    "dtype": "DT_FLOAT",
                    "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1" }] }
                }
            }
        },
        "modelTopology": {
            "node": [{
                    "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": {
                                    "dim": [
                                        { "size": "3" },
                                        { "size": "3" },
                                        { "size": "3" },
                                        { "size": "32" }
                                    ]
                                }
                            }
                        },
                        "dtype": { "type": "DT_FLOAT" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "32" }] }
                            }
                        },
                        "dtype": { "type": "DT_FLOAT" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": {
                                    "dim": [
                                        { "size": "3" },
                                        { "size": "3" },
                                        { "size": "32" },
                                        { "size": "64" }
                                    ]
                                }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "64" }] }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": {
                                    "dim": [
                                        { "size": "3" },
                                        { "size": "3" },
                                        { "size": "64" },
                                        { "size": "64" }
                                    ]
                                }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "64" }] }
                            }
                        },
                        "dtype": { "type": "DT_FLOAT" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/flatten/Const",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_INT32" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_INT32",
                                "tensorShape": { "dim": [{ "size": "2" }] }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": {
                                    "dim": [{ "size": "73984" }, { "size": "256" }]
                                }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "256" }] }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "256" }, { "size": "1" }] }
                            }
                        }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                    "op": "Const",
                    "attr": {
                        "dtype": { "type": "DT_FLOAT" },
                        "value": {
                            "tensor": {
                                "dtype": "DT_FLOAT",
                                "tensorShape": { "dim": [{ "size": "1" }] }
                            }
                        }
                    }
                },
                {
                    "name": "conv2d_input",
                    "op": "Placeholder",
                    "attr": {
                        "shape": {
                            "shape": {
                                "dim": [
                                    { "size": "-1" },
                                    { "size": "150" },
                                    { "size": "150" },
                                    { "size": "3" }
                                ]
                            }
                        },
                        "dtype": { "type": "DT_FLOAT" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d/Relu",
                    "op": "_FusedConv2D",
                    "input": [
                        "conv2d_input",
                        "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
                        "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"
                    ],
                    "device": "/device:CPU:0",
                    "attr": {
                        "strides": { "list": { "i": ["1", "1", "1", "1"] } },
                        "use_cudnn_on_gpu": { "b": true },
                        "explicit_paddings": { "list": {} },
                        "padding": { "s": "VkFMSUQ=" },
                        "epsilon": { "f": 0.0 },
                        "data_format": { "s": "TkhXQw==" },
                        "num_args": { "i": "1" },
                        "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
                        "T": { "type": "DT_FLOAT" },
                        "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
                    "op": "MaxPool",
                    "input": ["StatefulPartitionedCall/sequential/conv2d/Relu"],
                    "attr": {
                        "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
                        "strides": { "list": { "i": ["1", "2", "2", "1"] } },
                        "data_format": { "s": "TkhXQw==" },
                        "padding": { "s": "VkFMSUQ=" },
                        "T": { "type": "DT_FLOAT" },
                        "explicit_paddings": { "list": {} }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_1/Relu",
                    "op": "_FusedConv2D",
                    "input": [
                        "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
                        "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
                        "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"
                    ],
                    "device": "/device:CPU:0",
                    "attr": {
                        "epsilon": { "f": 0.0 },
                        "T": { "type": "DT_FLOAT" },
                        "strides": { "list": { "i": ["1", "1", "1", "1"] } },
                        "num_args": { "i": "1" },
                        "data_format": { "s": "TkhXQw==" },
                        "padding": { "s": "VkFMSUQ=" },
                        "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
                        "explicit_paddings": { "list": {} },
                        "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
                        "use_cudnn_on_gpu": { "b": true }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
                    "op": "MaxPool",
                    "input": ["StatefulPartitionedCall/sequential/conv2d_1/Relu"],
                    "attr": {
                        "explicit_paddings": { "list": {} },
                        "padding": { "s": "VkFMSUQ=" },
                        "data_format": { "s": "TkhXQw==" },
                        "T": { "type": "DT_FLOAT" },
                        "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
                        "strides": { "list": { "i": ["1", "2", "2", "1"] } }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_2/Relu",
                    "op": "_FusedConv2D",
                    "input": [
                        "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
                        "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
                        "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"
                    ],
                    "device": "/device:CPU:0",
                    "attr": {
                        "data_format": { "s": "TkhXQw==" },
                        "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
                        "strides": { "list": { "i": ["1", "1", "1", "1"] } },
                        "epsilon": { "f": 0.0 },
                        "padding": { "s": "VkFMSUQ=" },
                        "T": { "type": "DT_FLOAT" },
                        "explicit_paddings": { "list": {} },
                        "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
                        "use_cudnn_on_gpu": { "b": true },
                        "num_args": { "i": "1" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/flatten/Reshape",
                    "op": "Reshape",
                    "input": [
                        "StatefulPartitionedCall/sequential/conv2d_2/Relu",
                        "StatefulPartitionedCall/sequential/flatten/Const"
                    ],
                    "attr": {
                        "Tshape": { "type": "DT_INT32" },
                        "T": { "type": "DT_FLOAT" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/Relu",
                    "op": "_FusedMatMul",
                    "input": [
                        "StatefulPartitionedCall/sequential/flatten/Reshape",
                        "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                        "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
                    ],
                    "device": "/device:CPU:0",
                    "attr": {
                        "epsilon": { "f": 0.0 },
                        "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
                        "transpose_b": { "b": false },
                        "transpose_a": { "b": false },
                        "T": { "type": "DT_FLOAT" },
                        "num_args": { "i": "1" }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd",
                    "op": "_FusedMatMul",
                    "input": [
                        "StatefulPartitionedCall/sequential/dense/Relu",
                        "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                        "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
                    ],
                    "device": "/device:CPU:0",
                    "attr": {
                        "transpose_b": { "b": false },
                        "T": { "type": "DT_FLOAT" },
                        "transpose_a": { "b": false },
                        "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
                        "num_args": { "i": "1" },
                        "epsilon": { "f": 0.0 }
                    }
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/Sigmoid",
                    "op": "Sigmoid",
                    "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"],
                    "attr": { "T": { "type": "DT_FLOAT" } }
                },
                {
                    "name": "Identity",
                    "op": "Identity",
                    "input": ["StatefulPartitionedCall/sequential/dense_1/Sigmoid"],
                    "attr": { "T": { "type": "DT_FLOAT" } }
                }
            ],
            "library": {},
            "versions": { "producer": 1087 }
        },
        "weightsManifest": [{
            "paths": [
                "group1-shard1of19.bin",
                "group1-shard2of19.bin",
                "group1-shard3of19.bin",
                "group1-shard4of19.bin",
                "group1-shard5of19.bin",
                "group1-shard6of19.bin",
                "group1-shard7of19.bin",
                "group1-shard8of19.bin",
                "group1-shard9of19.bin",
                "group1-shard10of19.bin",
                "group1-shard11of19.bin",
                "group1-shard12of19.bin",
                "group1-shard13of19.bin",
                "group1-shard14of19.bin",
                "group1-shard15of19.bin",
                "group1-shard16of19.bin",
                "group1-shard17of19.bin",
                "group1-shard18of19.bin",
                "group1-shard19of19.bin"
            ],
            "weights": [{
                    "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
                    "shape": [3, 3, 3, 32],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
                    "shape": [32],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
                    "shape": [3, 3, 32, 64],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
                    "shape": [3, 3, 64, 64],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
                    "shape": [64],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/flatten/Const",
                    "shape": [2],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "shape": [73984, 256],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                    "shape": [256],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "shape": [256, 1],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                    "shape": [1],
                    "dtype": "float32"
                }
            ]
        }]
    }
}